<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Spring 2023, Sections 002
</span>
</center></b>
<br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 2, Part 1<br>Continuing Core Concepts, ER Modeling, Relational Algebra, SQL<br>
    
</span>
</center></i>

# Introduction and Overview

## HW Objectives

- HW 2, part 1 is for __both tracks.__


- We have covered additional concepts since HW 1. HW 2, part 1 tests and reinforces learning the new concepts.

## Submission Instructions

Complete all the tests in this notebook and submit only this notebook as a PDF to GradeScope. To convert the jupyter notebook into a pdf you can use either of the following methods:

- File --> Print Preview --> Print --> Save to PDF 

- File --> Download As HTML --> Print --> Save to PDF


__Due date: March 1, 11:59 PM EDT on GradeScope__



It is recommended that you put the screenshots into the same folder as this notebook so you do not have to alter the path to include your images. 


Please read all the instructions thoroughly!

## Guidelines

You may not work with or collaborate with anyone in any way to complete the homework. You may speak with the professor and TAs. You may ask __private__ questions on Ed if you need clarification.


You may use lecture slides, the textbook slides, the textbook or public information on the web to help you answer your questions. You may not "cut and past" information. Your answer must be in your own words and demonstrate the you understand the concept. If you use information for sources other than lectures, lecture slides, textbook slides or the textbook, you MUST provide a URL to the source you used.

## Add Student Information

1. Replace my name with your full name.
2. Replace my UNI with your UNI.
3. Replace "Cool Track" with either "Programming" or "Non-programming."

In [1]:
# Print your name, uni, and track below

name = "Ziggy Chen"
uni = "xc2605"
track = "Programming Track"

print(name)
print(uni)
print(track)

Ziggy Chen
xc2605
Programming Track

# Testing Environment

Run the following cells to ensure that your environment is set up.


You may need to change passwords.

## General Packages

In [2]:
import json

In [3]:
import csv

In [4]:
import pandas

In [5]:
import os

## pymysql

In [6]:
import pymysql

In [7]:
#
# Run this cell but change your user ID and password.
#
pymysql_conn = pymysql.connect(
    user="root",
    password="dbuserdbuser",
    host="localhost",
    port=3306,
    autocommit=True,
    cursorclass=pymysql.cursors.DictCursor
)

In [8]:
# You must have installed the db_book DB for this to work.
#
cursor = pymysql_conn.cursor()
sql = "select * from db_book.student"
res = cursor.execute(sql)
result = cursor.fetchall()

In [9]:
#
# You must have installed the db_book DB for this to work.
#
df1 = pandas.DataFrame(result)
df1

       ID      name   dept_name tot_cred
0   00128     Zhang  Comp. Sci.      102
1   12345   Shankar  Comp. Sci.       32
2   19991    Brandt     History       80
3   23121    Chavez     Finance      110
4   44553   Peltier     Physics       56
5   45678      Levy     Physics       46
6   54321  Williams  Comp. Sci.       54
7   55739   Sanchez       Music       38
8   70557      Snow     Physics        0
9   76543     Brown  Comp. Sci.       58
10  76653       Aoi  Elec. Eng.       60
11  98765  Bourikas  Elec. Eng.       98
12  98988    Tanaka     Biology      120

## ipython-SQL

In [10]:
%load_ext sql

In [11]:
#
# Remember to change your user ID and password.
#
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [12]:
%sql select * from db_book.student where ID=12345

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('12345', 'Shankar', 'Comp. Sci.', Decimal('32'))]

## SQLAlchemy

In [13]:
from sqlalchemy import create_engine

In [14]:
#
# Remember to change your user ID and password.
#
sql_url = "mysql+pymysql://root:dbuserdbuser@localhost"

In [15]:
engine = create_engine(sql_url)

In [16]:
sql = "select * from db_book.student"
df = pandas.read_sql(sql, con=engine)

In [17]:
df

       ID      name   dept_name  tot_cred
0   00128     Zhang  Comp. Sci.     102.0
1   12345   Shankar  Comp. Sci.      32.0
2   19991    Brandt     History      80.0
3   23121    Chavez     Finance     110.0
4   44553   Peltier     Physics      56.0
5   45678      Levy     Physics      46.0
6   54321  Williams  Comp. Sci.      54.0
7   55739   Sanchez       Music      38.0
8   70557      Snow     Physics       0.0
9   76543     Brown  Comp. Sci.      58.0
10  76653       Aoi  Elec. Eng.      60.0
11  98765  Bourikas  Elec. Eng.      98.0
12  98988    Tanaka     Biology     120.0

# Relational Algebra

## Instructions

- Use the [schema and data](https://dbis-uibk.github.io/relax/calc/gist/4f7866c17624ca9dfa85ed2482078be8/relax-silberschatz-english.txt/0) associated with the recommended textbook. Clicking the link should take you directly to the RelaX page configured with the DB.


- Your submission format for each question is:
    - A Markdown cell with a copy of your relational algebra statement.
    - A screen shot of the execution. If the expression returns several result pages, you only need to show the first page.
    - There is an example below.

_Example_

Question:

Write a relational statement that produces a relation of the form:
- ```student_id``` is ```student.ID```
- ```student_name``` is ```student.name```
- ```advisor_id``` is ```instructor.ID```
- ```advisor_name``` is ```instructor.name```

The ```advisor``` table is an associative entity for ```student``` and ```instructor```.

Relational statement:

```π student_ID←student.ID, student_name←student.name,
	advisor_ID←instructor.ID, advisor_name←instructor.name
((
	student ⨝ 
		advisor.s_id=student.ID ∧ advisor.i_id = advisor.i_id
	advisor
)
⨝ instructor.ID=advisor.i_id
instructor
)
```

_Capture_

<img src="./relational_example_1.png">

## Question R1: Courses and Prereq

_Question_

- Please run the following relational algebra statement. The statement produces a table of course that do not have preqs and courses that are not prereq.

```
(π course_id←course.course_id, prereq_id←'None' (course ▷ prereq))
∪
(π
	course_id←'None', prereq_id←course.course_id 
	(course ▷ course.course_id=prereq.prereq_id prereq)
)
```


- Please write an equivalent query that does not use ```anti-join.```

_Answer_

```
π course_id ← course.course_id, prereq_id ← 'None' (
	σ prereq.course_id = null (course ⟕ course.course_id = prereq.course_id prereq)
) 
∪
π course_id ← 'None', prereq_id ← course.course_id (
    σ prereq.prereq_id = null (course ⟕ course.course_id = prereq.prereq_id prereq)
)
```

_Capture_

<img src="./R1Diagram.png">
<img src="./R1Table.png">

## Question R2:  Instructors and Credits

_Question_

Please write a relational algebra statement that produces a relation of the form:
- Columns
    - ```instructor_name``` is ```instructor.name```
    - ```instructor_id``` is ```instructor.ID```
    - ```teaching_credits_yearly``` is the total course credits that the instructor taught in a year. The information needed is in ```teaches``` and ```course```.
    - ```year``` is from ```teaches```.
- Sort the result by ```instructor_name``` and then ``year```.

_Answer_

```
τ instructor_name,  year 
(π instructor_name ← instructor.name, instructor_id ← instructor.ID, teaching_credits_yearly, year ← teaches.year
	(
		γ teaches.ID, year; sum(course.credits) → teaching_credits_yearly (teaches ⟕ course) 
		⨝ teaches.ID = instructor.ID instructor
	)
)
```

_Capture_

<img src="./R2Diagram.png">
<img src="./R2Table.png">

# ER Modeling and Implementation

## Data

- We will do bottom up modeling and implementation starting with data.


- There are two entity sets for reengineering:
    1. ```customers```
    2. ```reservations``` is a single set containing three types of reservation:
        1. ```Flight```
        2. ```Rental car```
        3. ```Hotel```


- The input data is:

In [18]:
customers_df = pandas.read_csv('./customers-3.csv')

In [19]:
customers_df

,customer_id,first_name,last_name,email
0,4fc2a5e7-859c-494f-9f82-9ef3da9c6265,Lew,Jagiela,ljagiela0@comsenz.com
1,e649dc5e-5570-43f6-837c-89379800179f,Karin,De Ruggiero,kderuggiero1@linkedin.com
2,a20afabf-86af-4070-9c7c-4b4643202013,Georgena,Gapp,ggapp2@ed.gov
3,12d17b18-f009-49fd-a887-eaab9cd60274,Enrika,Thripp,ethripp3@newsvine.com
4,d9a14dd2-0000-4227-bf30-6907efb4caa7,Edin,Seyler,eseyler4@geocities.jp
...,...,...,...,...
995,bbe5ca2a-b5e1-4ff6-a1d6-450bdf41f6ec,Sean,Wagen,swagenr8@abc.net.au
996,a6632fc7-316b-4ad5-9b2c-977f7a732d54,Delmar,Benoy,dbenoyr9@multiply.com
997,3f05996b-5c79-429f-aacb-2367255cc495,Crin,Smooth,csmoothra@blogger.com
998,8e88da67-2e28-4330-bfa2-17c4369c96cf,Riobard,Ricket,rricketrb@va.gov
999,493ca6a1-b2c7-4c1d-817f-3a0d73f8f24c,Neville,Blowen,nblowenrc@etsy.com

In [20]:
reservations_df = pandas.read_csv("./reservations-3.csv")

In [21]:
import numpy as np

In [22]:
reservations_df = reservations_df.replace({np.nan: None})

In [23]:
reservations_df

,reservation_id,customer_id,reservation_type,price,reservation_date,city,reservation_start,reservation_end,car_category,room_category,bed_category,flight_departure_time,flight_arrival_time,departure_airport,arrival_airport
0,b097458e-898a-40a0-85eb-cedb0ea47466,4fc2a5e7-859c-494f-9f82-9ef3da9c6265,Car,$126.30,2/23/2022,Granja,2/21/2022,8/18/2022,Midsize,None,None,None,None,None,None
1,67070e81-81f0-4d95-9302-98486a08bf73,e649dc5e-5570-43f6-837c-89379800179f,Hotel,$792.89,1/30/2023,Kavalerovo,8/23/2022,1/19/2023,None,Studio,King,None,None,None,None
2,f164e71e-4874-4c42-beb4-27c2c6f5af0f,a20afabf-86af-4070-9c7c-4b4643202013,Hotel,$660.09,9/30/2022,Daxi,8/20/2022,8/23/2022,None,Suite,Two Doubles,None,None,None,None
3,7b088670-9567-4068-8571-946dd085dab5,12d17b18-f009-49fd-a887-eaab9cd60274,Flight,$423.59,1/9/2023,None,None,None,None,None,None,12:59 AM,3:06 AM,MFR,SKV
4,ca849908-b88e-49d8-b52b-2aeb88b3c949,d9a14dd2-0000-4227-bf30-6907efb4caa7,Hotel,$552.07,11/5/2022,Albuquerque,8/24/2022,4/15/2022,None,Suite,King,None,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,16b955d3-0181-4ad3-9654-0fea52bf1094,bbe5ca2a-b5e1-4ff6-a1d6-450bdf41f6ec,Hotel,$169.73,2/3/2023,Cibunar,12/17/2022,4/16/2022,None,Studio,King,None,None,None,None
996,caa55cf1-3032-42b4-94d5-2f8ac70585ce,a6632fc7-316b-4ad5-9b2c-977f7a732d54,Hotel,$517.19,6/12/2022,Quiling,3/12/2022,3/17/2022,None,Studio,King,None,None,None,None
997,e99b7c4f-1e14-42e1-9598-5010172f3454,3f05996b-5c79-429f-aacb-2367255cc495,Car,$636.63,2/11/2023,Hukeng,8/6/2022,7/19/2022,SUV,None,None,None,None,None,None
998,c54b4398-3eb7-46a0-9906-d2acc04f0e90,8e88da67-2e28-4330-bfa2-17c4369c96cf,Car,$174.76,11/10/2022,Pravdinsk,10/16/2022,12/7/2022,Compact,None,None,None,None,None,None
999,4c942bd8-2d80-4d57-9281-0e6387ed7f51,493ca6a1-b2c7-4c1d-817f-3a0d73f8f24c,Car,$662.24,11/10/2022,Kongolo,10/15/2022,4/3/2022,Midsize,None,None,None,None,None,None

## Model

- You are going to model _interitance/specialization._
    - There is a base entity type _Reservation._
    - _CarReservation_ __isA__ _Reservation._
    - _FlightReservation_ __isA__ _Reservation._
    - _HotelReservation_ __isA__ _Reservation._
    - The specialization is _complete_ and _disjoin._
    
    
- The following table shows which properties in the input data apply to which reservation type.

| Property              | Meaning                       | Car | Flight | Hotel |
|-----------------------|-------------------------------|-----|--------|-------|
| reservation_id        | Unique ID, primary key        | X   | X      | X     |
| customer_id           | Unique ID, foreign key        | X   | X      | X     |
| reservation_type      | Enum for type of reservation  | X   | X      | X     |
| price                 | Price to charge               | X   | X      | X     |
| reservation_date      | Date reservation made/changed | X   | X      | X     |
| city                  | City for reservation          | X   |        | X     |
| reservation_start     | Start date                    | X   |        | X     |
| reservation_end       | End date                      | X   |        | X     |
| car_category          | Enum                          | X   |        |       |
| room_category         | Enum                          |     |        | X     |
| bed_category          | Enum                          |     |        | X     |
| flight_departure_time | Takeoff time                  |     | X      |       |
| flight_arrival_time   | Arrival time                  |     | X      |       |
| departure_airport     | Departure airport code        |     | X      |       |
| arrival_airport     | Arrival airport code        |     | X      |       |

- The implementation pattern for inheritance will be:
    - _Reservations_ is a view.
    - There is a table for each of _CarReservation, FlightReservation, HotelReservation._

- We covered a simple example of modeling inheritance in class. The diagram notiation we used for _Person, Student, Faculty_ is:

<img src="./inheritance.png">

- Draw diagram for _Reservation, CarReservation, FlightReservation, HotelReservation_ using the pattern above.


- Your diagram should include a foreign key relationship from _Reservations_ to _Customers._


__Diagram__

- Here, we will use the one-table approach so that each type of reservation is a view, which has almost exactly the same pattern as that of the example we have seen in the lecture. For more details about the requirements of this part, please see Ed ```https://edstem.org/us/courses/32981/discussion/2658227``` . This implementation is intuitive and straightforward 

<img src="./diagram1.png">

## Implement

- You must draw a logical ER diagram for the four tables you will create. Your diagram does not have to include the view.


- Your diagram must include primary keys and foreign keys.


__Diagram__

- One-table approach includes (See Ed ```https://edstem.org/us/courses/32981/discussion/2656651``` for more details of the choice of one table approach). Again, it is straightforward and easy to implement.

<img src="./diagram2.png">

- Save the two dataframes into two tables (using pandas ```to_sql``` and schema ```s23_w4111_hw2_p1_<uni>```)
    - ```customers```
    - ```reservations```

In [24]:
# create the schema

%sql DROP SCHEMA IF EXISTS 23_w4111_hw2_p1_xc2605; # always drop before create
%sql CREATE SCHEMA 23_w4111_hw2_p1_xc2605; #re-create the schema

 * mysql+pymysql://root:***@localhost
5 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
0 rows affected.

[]

In [25]:
# convert df to sql
%sql use 23_w4111_hw2_p1_xc2605
print(
    'Number of rows in Customers: ' + 
      str(customers_df.to_sql(
          'customers', con=engine, 
                              schema='23_w4111_hw2_p1_xc2605', if_exists='replace', index=False)))
print(
    'Number of rows in Reservations: ' + 
      str(reservations_df.to_sql(
          'reservations', con=engine, 
                                 schema='23_w4111_hw2_p1_xc2605', if_exists='replace', index=False)))

 * mysql+pymysql://root:***@localhost
0 rows affected.
Number of rows in Customers: None
Number of rows in Reservations: None

- Use SQL to create the tables and data for the three types of reservation.


- Set appropriate data types and keys for the tables. 


- Show and execute your SQL for creating the tables and modifying the schema.

### **customers**

In [26]:
# describe the table
%sql DESCRIBE customers

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('customer_id', 'text', 'YES', '', None, ''),
 ('first_name', 'text', 'YES', '', None, ''),
 ('last_name', 'text', 'YES', '', None, ''),
 ('email', 'text', 'YES', '', None, '')]

In [27]:
%%sql
# identify max length
SELECT MAX(LENGTH(customer_id)), MAX(LENGTH(first_name)), MAX(LENGTH(last_name)), MAX(LENGTH(email)) 
FROM customers

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(36, 11, 14, 35)]

In [28]:
%%sql
# Set appropriate data types and keys for customers
ALTER TABLE customers MODIFY COLUMN customer_id varchar(64);
ALTER TABLE customers MODIFY COLUMN first_name varchar(32);
ALTER TABLE customers MODIFY COLUMN last_name varchar(32);
ALTER TABLE customers MODIFY COLUMN email varchar(64);
# PK
ALTER TABLE customers ADD PRIMARY KEY (customer_id);

 * mysql+pymysql://root:***@localhost
1000 rows affected.
1000 rows affected.
1000 rows affected.
1000 rows affected.
0 rows affected.

[]

In [29]:
# describe the table again to see if the operations worked
%sql DESCRIBE customers

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('customer_id', 'varchar(64)', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(32)', 'YES', '', None, ''),
 ('last_name', 'varchar(32)', 'YES', '', None, ''),
 ('email', 'varchar(64)', 'YES', '', None, '')]

### **reservations**

In [30]:
# describe the table
%sql DESCRIBE reservations

 * mysql+pymysql://root:***@localhost
15 rows affected.

[('reservation_id', 'text', 'YES', '', None, ''),
 ('customer_id', 'text', 'YES', '', None, ''),
 ('reservation_type', 'text', 'YES', '', None, ''),
 ('price', 'text', 'YES', '', None, ''),
 ('reservation_date', 'text', 'YES', '', None, ''),
 ('city', 'text', 'YES', '', None, ''),
 ('reservation_start', 'text', 'YES', '', None, ''),
 ('reservation_end', 'text', 'YES', '', None, ''),
 ('car_category', 'text', 'YES', '', None, ''),
 ('room_category', 'text', 'YES', '', None, ''),
 ('bed_category', 'text', 'YES', '', None, ''),
 ('flight_departure_time', 'text', 'YES', '', None, ''),
 ('flight_arrival_time', 'text', 'YES', '', None, ''),
 ('departure_airport', 'text', 'YES', '', None, ''),
 ('arrival_airport', 'text', 'YES', '', None, '')]

#### *ENUM*

In [31]:
%%sql
# see ENUM
SELECT DISTINCT reservation_type FROM reservations;

 * mysql+pymysql://root:***@localhost
3 rows affected.

[('Car',), ('Hotel',), ('Flight',)]

In [32]:
%%sql
# see ENUM
SELECT DISTINCT car_category FROM reservations;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('Midsize',), (None,), ('Compact',), ('SUV',)]

In [33]:
%%sql
# see ENUM
SELECT DISTINCT room_category FROM reservations;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[(None,), ('Studio',), ('Suite',), ('One Room',)]

In [34]:
%%sql
# see ENUM
SELECT DISTINCT bed_category FROM reservations;

 * mysql+pymysql://root:***@localhost
3 rows affected.

[(None,), ('King',), ('Two Doubles',)]

In [35]:
%%sql
# set ENUM variables
ALTER TABLE reservations
MODIFY COLUMN reservation_type ENUM('Car', 'Hotel', 'Flight');
ALTER TABLE reservations
MODIFY COLUMN car_category ENUM('Midsize', 'Compact', 'SUV');
ALTER TABLE reservations
MODIFY COLUMN room_category ENUM('Studio', 'Suite', 'One Room');
ALTER TABLE reservations
MODIFY COLUMN bed_category ENUM('King', 'Two Doubles');

 * mysql+pymysql://root:***@localhost
1000 rows affected.
1000 rows affected.
1000 rows affected.
1000 rows affected.

[]

#### *DATE*

In [36]:
%%sql
# check original format
SELECT reservation_date, reservation_start, reservation_end FROM reservations
LIMIT 12;

 * mysql+pymysql://root:***@localhost
12 rows affected.

[('2/23/2022', '2/21/2022', '8/18/2022'),
 ('1/30/2023', '8/23/2022', '1/19/2023'),
 ('9/30/2022', '8/20/2022', '8/23/2022'),
 ('1/9/2023', None, None),
 ('11/5/2022', '8/24/2022', '4/15/2022'),
 ('7/18/2022', '8/15/2022', '4/27/2022'),
 ('8/12/2022', '7/11/2022', '8/20/2022'),
 ('10/15/2022', '4/14/2022', '3/11/2022'),
 ('12/1/2022', '4/5/2022', '12/18/2022'),
 ('4/6/2022', '7/23/2022', '1/19/2023'),
 ('2/14/2023', '12/22/2022', '7/28/2022'),
 ('12/30/2022', None, None)]

In [37]:
%%sql
UPDATE reservations SET reservation_date = STR_TO_DATE (reservation_date, '%m/%e/%Y');
UPDATE reservations SET reservation_start = STR_TO_DATE (reservation_start, '%m/%e/%Y');
UPDATE reservations SET reservation_end = STR_TO_DATE (reservation_end, '%m/%e/%Y');

 * mysql+pymysql://root:***@localhost
1000 rows affected.
1000 rows affected.
1000 rows affected.

[]

In [38]:
%%sql
# check new format
SELECT reservation_date, reservation_start, reservation_end FROM reservations
LIMIT 12;

 * mysql+pymysql://root:***@localhost
12 rows affected.

[('2022-02-23', '2022-02-21', '2022-08-18'),
 ('2023-01-30', '2022-08-23', '2023-01-19'),
 ('2022-09-30', '2022-08-20', '2022-08-23'),
 ('2023-01-09', None, None),
 ('2022-11-05', '2022-08-24', '2022-04-15'),
 ('2022-07-18', '2022-08-15', '2022-04-27'),
 ('2022-08-12', '2022-07-11', '2022-08-20'),
 ('2022-10-15', '2022-04-14', '2022-03-11'),
 ('2022-12-01', '2022-04-05', '2022-12-18'),
 ('2022-04-06', '2022-07-23', '2023-01-19'),
 ('2023-02-14', '2022-12-22', '2022-07-28'),
 ('2022-12-30', None, None)]

In [39]:
%%sql
ALTER TABLE reservations
MODIFY COLUMN reservation_date DATE;
ALTER TABLE reservations
MODIFY COLUMN reservation_start DATE;
ALTER TABLE reservations
MODIFY COLUMN reservation_end DATE;

 * mysql+pymysql://root:***@localhost
1000 rows affected.
1000 rows affected.
1000 rows affected.

[]

In [40]:
%%sql
# identify max length
SELECT MAX(LENGTH(reservation_id)), MAX(LENGTH(price)), MAX(LENGTH(city)), MAX(LENGTH(flight_departure_time))
FROM reservations

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(36, 7, 28, 8)]

In [41]:
%%sql
# identify max length
SELECT MAX(LENGTH(flight_arrival_time)), MAX(LENGTH(departure_airport)), MAX(LENGTH(arrival_airport))
FROM reservations

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(8, 3, 3)]

In [42]:
%%sql
# Set appropriate data types and keys for reservations

ALTER TABLE reservations MODIFY COLUMN reservation_id varchar(64);
ALTER TABLE reservations MODIFY COLUMN customer_id varchar(64);
ALTER TABLE reservations MODIFY COLUMN price varchar(16);
ALTER TABLE reservations MODIFY COLUMN city varchar(64);
ALTER TABLE reservations MODIFY COLUMN flight_departure_time varchar(16);
ALTER TABLE reservations MODIFY COLUMN flight_arrival_time varchar(16);
ALTER TABLE reservations MODIFY COLUMN departure_airport varchar(8);
ALTER TABLE reservations MODIFY COLUMN arrival_airport varchar(8);

# PK
ALTER TABLE reservations ADD PRIMARY KEY (reservation_id);
ALTER TABLE reservations ADD FOREIGN KEY (customer_id) REFERENCES customers (customer_id) ;

 * mysql+pymysql://root:***@localhost
1000 rows affected.
1000 rows affected.
1000 rows affected.
1000 rows affected.
1000 rows affected.
1000 rows affected.
1000 rows affected.
1000 rows affected.
0 rows affected.
1000 rows affected.

[]

In [43]:
# describe the table again
%sql DESCRIBE reservations

 * mysql+pymysql://root:***@localhost
15 rows affected.

[('reservation_id', 'varchar(64)', 'NO', 'PRI', None, ''),
 ('customer_id', 'varchar(64)', 'YES', 'MUL', None, ''),
 ('reservation_type', "enum('Car','Hotel','Flight')", 'YES', '', None, ''),
 ('price', 'varchar(16)', 'YES', '', None, ''),
 ('reservation_date', 'date', 'YES', '', None, ''),
 ('city', 'varchar(64)', 'YES', '', None, ''),
 ('reservation_start', 'date', 'YES', '', None, ''),
 ('reservation_end', 'date', 'YES', '', None, ''),
 ('car_category', "enum('Midsize','Compact','SUV')", 'YES', '', None, ''),
 ('room_category', "enum('Studio','Suite','One Room')", 'YES', '', None, ''),
 ('bed_category', "enum('King','Two Doubles')", 'YES', '', None, ''),
 ('flight_departure_time', 'varchar(16)', 'YES', '', None, ''),
 ('flight_arrival_time', 'varchar(16)', 'YES', '', None, ''),
 ('departure_airport', 'varchar(8)', 'YES', '', None, ''),
 ('arrival_airport', 'varchar(8)', 'YES', '', None, '')]

### Create views for the three sub-type reservation

### car_reservation view (one-table approach)

#### Create the view

In [44]:
%%sql

CREATE OR REPLACE VIEW car_reservation AS
SELECT reservation_id, customer_id, reservation_type, price, 
reservation_date, city, reservation_start, reservation_end, car_category
FROM reservations
WHERE reservation_type = 'car'

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

#### Display some rows

In [45]:
%%sql 

SELECT * 
FROM car_reservation
LIMIT 12;

 * mysql+pymysql://root:***@localhost
12 rows affected.

[('00286f61-0cab-4d84-a3f6-06f62d905421', '04c8292b-f332-4f68-a5b9-23048bfd0158', 'Car', '$901.91', datetime.date(2022, 7, 16), 'Beiwa', datetime.date(2022, 11, 17), datetime.date(2022, 8, 7), 'SUV'),
 ('0040aecb-be4a-403e-9f14-d9fc034745ed', 'b1493d4e-8d20-4f9f-bcb3-cb74297409e1', 'Car', '$227.57', datetime.date(2022, 4, 20), 'Bileća', datetime.date(2022, 12, 27), datetime.date(2022, 3, 15), 'SUV'),
 ('01bb4d70-4080-433b-a8ab-0076092366b6', '3dc1ffc5-a2ff-4194-abdf-c6b20a91955f', 'Car', '$373.72', datetime.date(2022, 12, 4), 'Gävle', datetime.date(2022, 9, 22), datetime.date(2023, 1, 4), 'Midsize'),
 ('03bd05af-eee8-40da-a826-0acf3ae1a693', '10653a51-d23e-4e77-9e77-560cce6f4de0', 'Car', '$286.06', datetime.date(2022, 5, 10), 'Chernelytsya', datetime.date(2022, 9, 30), datetime.date(2022, 8, 6), 'SUV'),
 ('05a82fa8-6356-48f4-91bf-2fd9a82c60e4', '8db8ff96-6089-4dce-9e2f-d98405abbc8e', 'Car', '$256.83', datetime.date(2022, 7, 25), 'Alkmaar', datetime.date(2022, 4, 13), datetime.date(2022, 2, 22), 'SUV'),
 ('05fb6841-470e-4e84-b4f8-7dd07265c5e3', 'fd05f02c-89d6-4278-bc74-48aeeaf4cf23', 'Car', '$942.55', datetime.date(2022, 4, 19), 'Changzheng', datetime.date(2022, 9, 19), datetime.date(2022, 7, 6), 'Midsize'),
 ('07529b64-8491-4b97-84fe-4db97f317394', '790b5b32-7455-4fb2-b8c9-2e6b2ba744e7', 'Car', '$792.48', datetime.date(2022, 4, 6), 'Mojo', datetime.date(2022, 7, 23), datetime.date(2023, 1, 19), 'SUV'),
 ('077a3d5c-f759-43e6-9c81-ce48a846014d', '760301aa-24bd-44a9-b3d7-4b893f0c9e92', 'Car', '$232.14', datetime.date(2022, 3, 25), 'Néa Sánta', datetime.date(2022, 9, 18), datetime.date(2022, 3, 10), 'Midsize'),
 ('08434a56-921d-4fe3-ac0e-20ccfbbdaa81', '93b70aac-9725-4c72-91b1-0259a20a2453', 'Car', '$682.98', datetime.date(2023, 2, 1), 'Huasta', datetime.date(2022, 9, 4), datetime.date(2022, 5, 22), 'Midsize'),
 ('0b4db617-6b35-4bcd-a280-2ed8ac6aa5ec', '6071a446-fd8e-4482-9a17-5565f5b41fae', 'Car', '$316.74', datetime.date(2022, 6, 16), 'Yepocapa', datetime.date(2022, 10, 1), datetime.date(2022, 8, 5), 'SUV'),
 ('0b4e459a-eee7-4d3b-bc71-9833a1fe42c8', '3ff4172e-351c-4e4d-ab99-2b699bb48cd3', 'Car', '$155.16', datetime.date(2022, 6, 9), 'Baitian', datetime.date(2022, 10, 4), datetime.date(2022, 7, 1), 'SUV'),
 ('0cb75f4c-9238-43d7-830e-08fca583645b', '9c9d8c69-377f-441e-9aa7-694cf085cc59', 'Car', '$214.07', datetime.date(2022, 7, 15), 'Dofa', datetime.date(2022, 8, 27), datetime.date(2022, 3, 27), 'SUV')]

### flgiht_reservation view (one-table approach)

#### Create the view

In [46]:
%%sql

CREATE OR REPLACE VIEW flight_reservation AS
SELECT reservation_id, customer_id, reservation_type, price, reservation_date, 
flight_departure_time, flight_arrival_time, departure_airport, arrival_airport
FROM reservations
WHERE reservation_type = 'flight'

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

#### Display some rows

In [47]:
%%sql 

SELECT * 
FROM flight_reservation
LIMIT 12;

 * mysql+pymysql://root:***@localhost
12 rows affected.

[('001df543-977c-4f59-9547-8d097a49c6d5', '2d1fc0e9-ec65-4e13-981c-06428f24d820', 'Flight', '$143.17', datetime.date(2022, 6, 30), '2:08 AM', '5:52 AM', 'MSW', 'PLS'),
 ('0066306f-1691-4d3f-9883-7b7dcbbb57a0', '79a536d2-dc93-4247-84fb-13fae6dea683', 'Flight', '$348.16', datetime.date(2022, 6, 26), '2:21 PM', '6:53 PM', 'TYR', 'DOV'),
 ('01a4b0ee-2b79-43a9-9ce4-f06c944e7ab7', '59f379e9-a981-4bb6-bc1e-6dfee479cf37', 'Flight', '$861.07', datetime.date(2022, 4, 23), '6:21 AM', '4:21 AM', 'LSN', 'WMN'),
 ('03412b08-6698-45db-9439-21d0ce091928', '9b099903-06f9-45a0-b630-850eba4aed19', 'Flight', '$306.88', datetime.date(2022, 4, 21), '8:37 PM', '7:54 AM', 'YYZ', 'BER'),
 ('037a0420-8f36-4a15-aee4-ceef249bea5c', '5240a226-cb67-49fe-9a08-5fb12ffc0baa', 'Flight', '$518.37', datetime.date(2022, 8, 16), '5:24 PM', '9:58 PM', 'KBC', 'AVG'),
 ('04ba2594-3556-4f1f-9f27-f335a72df786', 'fe0a335c-6ced-45c7-a30f-23b83a2d1147', 'Flight', '$188.93', datetime.date(2023, 2, 9), '6:48 AM', '4:23 PM', 'NHF', 'BJL'),
 ('05978490-2889-4ef0-ac1c-82236c90e905', 'c01d2573-e406-4490-9955-53e8ea32b62f', 'Flight', '$512.72', datetime.date(2022, 10, 16), '9:27 PM', '9:52 PM', 'BLN', 'ERA'),
 ('06bc222a-5301-4066-84fb-074849517c5c', 'c227de5d-bda5-4d7b-bbbe-5c7f1d110141', 'Flight', '$906.91', datetime.date(2022, 7, 20), '12:52 AM', '4:02 PM', 'KOL', 'HAH'),
 ('07fb30e9-9e25-4138-8137-440fa79da669', '6ee8ccf5-4c32-4f58-99e1-fa907e5ae56b', 'Flight', '$783.12', datetime.date(2023, 1, 26), '11:14 AM', '9:43 PM', 'ACD', 'KMQ'),
 ('0ad3083e-5d46-42e3-9f3f-065d5bb0f9db', 'f8e538cf-5b2a-41ce-843b-33122970c2ba', 'Flight', '$772.81', datetime.date(2022, 7, 24), '4:13 AM', '8:53 AM', 'GUV', 'ARE'),
 ('0b11d477-eeef-45a8-a04f-5e92a8176ed4', '44d02bd6-5246-4ec7-8d23-c2844dd1443a', 'Flight', '$587.90', datetime.date(2022, 11, 26), '5:36 PM', '3:00 PM', 'GRL', 'HQM'),
 ('0da67089-4dff-4b0e-9603-2c5ed9b60f53', '15028adf-49da-4c74-b5ff-2a723caf23e6', 'Flight', '$143.44', datetime.date(2022, 3, 31), '6:39 PM', '3:38 AM', 'LLE', 'QOA')]

### hotel_reservation view (one-table approach)

#### Create the view

In [48]:
%%sql

CREATE OR REPLACE VIEW hotel_reservation AS
SELECT reservation_id, customer_id, reservation_type, price, reservation_date, 
city, reservation_start, reservation_end, room_category, bed_category
FROM reservations
WHERE reservation_type = 'hotel'

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

#### Display some rows

In [49]:
%%sql 

SELECT * 
FROM hotel_reservation
LIMIT 12;

 * mysql+pymysql://root:***@localhost
12 rows affected.

[('010eb023-4fe2-42f7-bac4-35a7e4290b6b', '40085bc3-80e8-4b8e-83ec-1ac7b524da29', 'Hotel', '$428.67', datetime.date(2022, 10, 23), 'Jingjiao', datetime.date(2023, 1, 2), datetime.date(2022, 10, 5), 'Suite', 'King'),
 ('01601bea-efa9-4784-95bc-d124affe91c4', 'cec93f53-7984-438c-8ce1-f3e5f340cfcb', 'Hotel', '$200.43', datetime.date(2022, 8, 14), 'Xidajie', datetime.date(2022, 12, 10), datetime.date(2022, 12, 21), 'One Room', 'Two Doubles'),
 ('021998b0-171f-4eb8-86ce-16e753277d9a', 'add731ae-a6e6-4698-b2d9-17cdffcaa095', 'Hotel', '$715.87', datetime.date(2022, 11, 29), 'Belo Jardim', datetime.date(2022, 8, 15), datetime.date(2022, 10, 25), 'One Room', 'Two Doubles'),
 ('056ab12e-8609-4239-947f-27b77d818f24', '84fdad0d-0835-40a0-ac3f-ded127305848', 'Hotel', '$554.83', datetime.date(2022, 5, 7), 'Třinec', datetime.date(2022, 3, 7), datetime.date(2022, 10, 23), 'Studio', 'King'),
 ('07cf8a9b-75e9-4717-9d85-f672a5824834', '66394ac3-cbeb-44b1-8933-8df224d91817', 'Hotel', '$608.56', datetime.date(2022, 5, 2), 'Zaozerne', datetime.date(2022, 4, 19), datetime.date(2022, 4, 26), 'Studio', 'Two Doubles'),
 ('0b292693-adfd-4313-bca0-48e1f08345f6', 'd9544b31-d41e-46d3-ae95-2fb0d71b539b', 'Hotel', '$558.76', datetime.date(2022, 3, 8), 'Turija', datetime.date(2022, 3, 28), datetime.date(2022, 11, 30), 'One Room', 'King'),
 ('0b6d6ce9-493a-4b7a-bd8c-538e3f595a64', '5da8e62a-26ad-4497-998d-3c714161e7bb', 'Hotel', '$322.19', datetime.date(2022, 3, 8), 'Jiedu', datetime.date(2022, 12, 10), datetime.date(2022, 9, 18), 'Studio', 'King'),
 ('0be9d85a-feb4-432e-98a7-ee016a8f1db0', '51f59855-47d3-4ba7-8478-5ebefa8f7d93', 'Hotel', '$221.48', datetime.date(2023, 1, 7), 'Dūāb', datetime.date(2022, 9, 30), datetime.date(2023, 1, 18), 'Studio', 'Two Doubles'),
 ('0c015520-51fd-492e-af49-e42d094af906', '0f07114b-7bd3-456d-bb63-51a2ba5c7617', 'Hotel', '$343.86', datetime.date(2022, 5, 4), 'Roissy Charles-de-Gaulle', datetime.date(2022, 6, 28), datetime.date(2023, 1, 16), 'Studio', 'Two Doubles'),
 ('0c463afb-3079-46f0-9214-bc24a026c2ec', 'ae9c8fbc-c47d-477f-881a-3278ed53d3c1', 'Hotel', '$419.14', datetime.date(2023, 1, 2), 'Penang', datetime.date(2022, 5, 23), datetime.date(2022, 6, 2), 'Suite', 'Two Doubles'),
 ('0cc6ca0b-46ed-4a7f-859c-ed2181a58e07', '643f5346-1f9e-4c05-9bb8-e1c1ec646f83', 'Hotel', '$352.74', datetime.date(2022, 10, 12), 'Vänersborg', datetime.date(2022, 11, 21), datetime.date(2023, 1, 27), 'Suite', 'King'),
 ('0ce484ff-f787-4d92-bb45-417217be019d', 'd45ff140-809f-47d8-aa64-155da8e8ec0c', 'Hotel', '$222.68', datetime.date(2022, 9, 17), 'Itoman', datetime.date(2022, 12, 18), datetime.date(2022, 4, 3), 'One Room', 'Two Doubles')]